<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [2]:
import pandas as pd
import psycopg2

In [3]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [4]:
connection = psycopg2.connect(
   dbname='project_sql',
   user='skillfactory',
   host='84.201.134.129',
   password='cCkxxLVrDE8EbvjueeMedPKt',
   port=5432
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# текст запроса
query_3_1 = f'''select
           COUNT (id)
           from vacancies
        '''
        
        
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\3858970120.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

In [28]:
Результат запроса
count
0	49197

SyntaxError: invalid syntax (632887403.py, line 1)

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = f'''select
           COUNT (id)
           from employers
        '''
        
        
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\3760325785.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

In [ ]:
Результат запроса 
	count
0	23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
query_3_3 = f'''select
           COUNT (id)
           from areas
        '''
        
        
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\2530835143.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

In [10]:
Результат зпроса
 
count
0	1362

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4 = f'''select
           COUNT (id)
           from industries
        '''
        
        
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\1430721168.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

In [12]:
Результат зпроса 
count
0	294

294

***

**Выводы по предварительному анализу данных:**

          - Общее количетво вакансий равно 	49197;

          - Общее количество работодателей        23501;

          - Количетво регионов или населенных пунктов, в которых размещены вакансии  1362;
          
          - Общее количетво сфер деятельности  294.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [14]:
query_4_1 = f'''select
           COUNT (v.id),
           a.name
           from vacancies v
           JOIN areas a ON v.area_id=a.id
           Group by a.name
           ORDER BY 1 DESC
        '''
        
        
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\2301481950.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

     count             name
0     5333           Москва
1     2851  Санкт-Петербург
2     2112            Минск
3     2006      Новосибирск
4     1892           Алматы
..     ...              ...
764      1       Тарко-Сале
765      1    Новоаннинский
766      1            Бирск
767      1           Сасово
768      1             Анна

[769 rows x 2 columns]

In [ ]:
Результат запроса 
	count	name
0	5333	Москва
1	2851	Санкт-Петербург
2	2112	Минск
3	2006	Новосибирск
4	1892	Алматы
...	...	...
764	1	Тарко-Сале
765	1	Новоаннинский
766	1	Бирск
767	1	Сасово
768	1	Анна
769 rows × 2 columns

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
query_4_2 = f'''select
           COUNT (id)
           from vacancies 
           Where salary_from IS NOT NULL OR salary_to IS NOT NULL 
        '''
        
        
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\2740155939.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

In [ ]:
Результат запроса
	count
0	24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
query_4_3 = f'''select
           AVG(salary_from),
           AVG(salary_to)
           from vacancies
        '''
        
        
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\4073984623.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

            avg            avg
0  71064.657901  110536.741923

In [18]:
Результат запроса 
	avg	avg
0	71064.657901	110536.741923

(71065, 110537)

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
query_4_4 = f'''select
           COUNT (id),
           employment,
           schedule       
           from vacancies 
           Group by schedule, employment
           ORDER BY 1 DESC
'''
        
        
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\1537219506.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

    count           employment          schedule
0   35367     Полная занятость       Полный день
1    7802     Полная занятость  Удаленная работа
2    1593     Полная занятость     Гибкий график
3    1312  Частичная занятость  Удаленная работа
4     940     Полная занятость    Сменный график
5     569           Стажировка       Полный день
6     367     Полная занятость    Вахтовый метод
7     347  Частичная занятость       Полный день
8     312  Частичная занятость     Гибкий график
9     141     Проектная работа       Полный день
10    133     Проектная работа  Удаленная работа
11    116           Стажировка     Гибкий график
12    101  Частичная занятость    Сменный график
13     64           Стажировка  Удаленная работа
14     18     Проектная работа     Гибкий график
15     12           Стажировка    Сменный график
16      2     Проектная работа    Вахтовый метод
17      1     Проектная работа    Сменный график

In [21]:
Результат запроса 
	count	employment	schedule
0	35367	Полная занятость	Полный день
1	7802	Полная занятость	Удаленная работа
2	1593	Полная занятость	Гибкий график
3	1312	Частичная занятость	Удаленная работа
4	940	Полная занятость	Сменный график
5	569	Стажировка	Полный день
6	367	Полная занятость	Вахтовый метод
7	347	Частичная занятость	Полный день
8	312	Частичная занятость	Гибкий график
9	141	Проектная работа	Полный день
10	133	Проектная работа	Удаленная работа
11	116	Стажировка	Гибкий график
12	101	Частичная занятость	Сменный график
13	64	Стажировка	Удаленная работа
14	18	Проектная работа	Гибкий график
15	12	Стажировка	Сменный график
16	2	Проектная работа	Вахтовый метод
17	1	Проектная работа	Сменный график

SyntaxError: invalid syntax (4092202378.py, line 1)

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
query_4_5 = f'''select
           experience,
           COUNT(id)
           from vacancies 
           Group by experience
           ORDER BY 2 
'''
        
        
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\1\ipykernel_20392\3805911801.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [ ]:
Результат запроса 
experience	count
0	Более 6 лет	1337
1	Нет опыта	          7197
2	От 3 до 6 лет	14511
3	От 1 года до 3 лет	26152

***

**Выводы по детальному анализу вакансий:**
          -Наиболее востребованный опыт работы - от 1 до 3 лет, из этого можно сделать вывод что компании ищут молодых специалистов.
          
          -Больше всего вакансий размещено с типом занятости Полная занятость/Полный день, вторую строчку в рейтинге занимает тип занятости Полный день/Удаленная работа. Мжно сделать вывод, что после ковидных ограничений работодатели готовы на удаленную работу и более лояльны к такому формату работы.
          
          -Среднее значение верхней границы ЗП в 1,5 раза больше среднего значения нижней границы ЗП.
          
          -Практически в 50% вакансий не указана одна из возможных границ по ЗП.
          
          -В крупных городах самое большое количество вакансий.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
query_5_1 = f'''select
           COUNT(v.id),
           e.name
           from vacancies v
           JOIN employers e ON v.employer_id=e.id
           Group by e.name
           ORDER BY 1 DESC
'''
        
        
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\5\ipykernel_23192\642219538.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

       count                    name
0       1933                  Яндекс
1        491              Ростелеком
2        444                Тинькофф
3        428                    СБЕР
4        331           Газпром нефть
...      ...                     ...
14761      1            им. Тьюринга
14762      1        LLC Novalab Tech
14763      1   Компания Мир упаковки
14764      1  Лифинцев Олег Иванович
14765      1      ТрансЭнергоХолдинг

[14766 rows x 2 columns]

In [ ]:
Результат запроса
	count	name
0	1933	Яндекс
1	491	Ростелеком
2	444	Тинькофф
3	428	СБЕР
4	331	Газпром нефть
...	...	...
14761	1	им. Тьюринга
14762	1	LLC Novalab Tech
14763	1	Компания Мир упаковки
14764	1	Лифинцев Олег Иванович
14765	1	ТрансЭнергоХолдинг
14766 rows × 2 columns

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
query_5_2 = f'''select
           a.name,
           COUNT(distinct e.name) em,
           COUNT(v.id) va
           from areas a
           LEFT JOIN vacancies v ON v.area_id=a.id
           JOIN employers e ON a.id = e.area
           WHERE v.id IS NULL
           Group by a.name
           ORDER BY 3, 2 DESC
           LIMIT 10
'''
        
        
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\233977986.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                    name   em  va
0                 Россия  410   0
1              Казахстан  207   0
2     Московская область   75   0
3     Краснодарский край   19   0
4     Ростовская область   18   0
5               Беларусь   18   0
6            Азербайджан   17   0
7  Нижегородская область   16   0
8   Республика Татарстан   16   0
9             Узбекистан   15   0

In [ ]:
Результат запроса 
	name	em	va
0	Россия	410	0
1	Казахстан	207	0
2	Московская область	75	0
3	Краснодарский край	19	0
4	Ростовская область	18	0
5	Беларусь	18	0
6	Азербайджан	17	0
7	Нижегородская область	16	0
8	Республика Татарстан	16	0
9	Узбекистан	15	0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
query_5_3 = f'''select
           e.name,
           COUNT(distinct v.area_id) a_count,
           COUNT(v.id) vacancies
           from vacancies v
           JOIN employers e ON e.id=v.employer_id
           Group by e.name
           ORDER BY 2 DESC

'''
        
        
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\1796039454.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  a_count  vacancies
0                      Яндекс      181       1933
1                  Ростелеком      152        491
2                  Спецремонт      116        151
3      Поляков Денис Иванович       88        127
4                   ООО ЕФИН        71         71
...                       ...      ...        ...
14761                  UniSol        1          1
14762            UNISTORY LLC        1          3
14763                   UNIT6        1          1
14764     United Distribution        1          1
14765              UNITEL LLC        1         38

[14766 rows x 3 columns]

In [ ]:
Результат запроса 
	name	a_count	vacancies
0	Яндекс	181	1933
1	Ростелеком	152	491
2	Спецремонт	116	151
3	Поляков Денис Иванович	88	127
4	ООО ЕФИН	71	71
...	...	...	...
14761	UniSol	1	1
14762	UNISTORY LLC	1	3
14763	UNIT6	1	1
14764	United Distribution	1	1
14765	UNITEL LLC	1	38
14766 rows × 3 columns

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
query_5_4 = f'''select
           COUNT(e.name) employer_name,
           ei.industry_id industry
           from employers e
           LEFT JOIN employers_industries ei ON e.id=ei.employer_id
           WHERE ei.industry_id is NULL
           GROUP BY ei.industry_id
           

'''
        
        
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\455486088.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   employer_name industry
0           8419     None

In [ ]:
Результат запроса 

employer_name	industry
0	8419	None

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
query_5_5 = f'''select
           e.name employer_name,
           COUNT(ei.industry_id) industry
           from employers e
           LEFT JOIN employers_industries ei ON e.id=ei.employer_id
           GROUP BY e.name
           HAVING COUNT(ei.industry_id) = 4
           ORDER BY 1
           
           

'''
        
        
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\1926070461.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

        employer_name  industry
0        101 Интернет         4
1            21vek.by         4
2                2ГИС         4
3                  2К         4
4         4 пикселя +         4
...               ...       ...
1131            ЮРИОН         4
1132  ЮТИП Технологии         4
1133           ЯКласс         4
1134            ЯрНео         4
1135    Яшин&Партнёры         4

[1136 rows x 2 columns]

In [ ]:
Результат запроса 
	employer_name	industry
0	101 Интернет	4
1	21vek.by	4
2	2ГИС	4
3	2К	4
4	4 пикселя +	4
...	...	...
1131	ЮРИОН	4
1132	ЮТИП Технологии	4
1133	ЯКласс	4
1134	ЯрНео	4
1135	Яшин&Партнёры	4
1136 rows × 2 columns

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
query_5_6 = f'''select
           COUNT(e.id) employer_id
           from employers e
           JOIN employers_industries ei ON e.id=ei.employer_id
           JOIN industries i ON ei.industry_id=i.id
           WHERE i.name = 'Разработка программного обеспечения'
           GROUP BY ei.industry_id

'''
        
        
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\645936143.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   employer_id
0         3553

In [ ]:
Результат запроса 

employer_id
0	3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

**Выводы по анализу работодателей:**

- ТОП-5 работодателей по количеству размещенных вакансий занимают ИТ-компании и банки. 

- 1136 компаний имеют не менее 4х сфер леятельности.

- Разработчики программного обеспечения занимают 13% от общего количесва размещенных вакансий.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
query_6_1 = f'''select
           COUNT(name)
           from vacancies 
           WHERE LOWER(name) LIKE '%data%' OR LOWER(name) LIKE '%данн%'
'''
        
        
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\1536957828.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

In [ ]:
Результат запроса 
count
0	1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
query_6_2 = f'''select
           COUNT(name)
           from vacancies 
           WHERE (LOWER(name) LIKE '%data scientist%' 
           OR LOWER(name) LIKE '%data science%'   
           OR LOWER(name) LIKE '%исследователь данных%'
           OR (LOWER(name) LIKE '%ml%' AND LOWER(name) NOT LIKE '%html%')
           OR LOWER(name) LIKE '%machine learning%'
           OR LOWER(name) LIKE '%машинн%обучен%')
           AND (LOWER(name) LIKE '%junior%'
           OR LOWER(experience) LIKE 'нет опыта'
           OR LOWER(employment) LIKE 'стажировка')
     
'''
        
        
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\1057641229.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

In [ ]:
Результат запроса 
	count
0	51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
query_6_3 = f'''select
           COUNT(name)
           from vacancies 
           WHERE (LOWER(name) LIKE '%data scientist%' 
           OR LOWER(name) LIKE '%data science%'   
           OR LOWER(name) LIKE '%исследователь данных%'
           OR (name LIKE '%ML%' AND LOWER(name) NOT LIKE '%html%')
           OR LOWER(name) LIKE '%machine learning%'
           OR LOWER(name) LIKE '%машинн%обучен%')
           AND (LOWER(key_skills) LIKE '%sql%' OR LOWER(key_skills) LIKE '%postgres%')
'''
        
        
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\2747065515.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

In [ ]:
Результат запроса 
	count
0	201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
query_6_4 = f'''select
           COUNT(name)
           from vacancies 
           WHERE (LOWER(name) LIKE '%data scientist%' 
           OR LOWER(name) LIKE '%data science%'   
           OR LOWER(name) LIKE '%исследователь данных%'
           OR (name LIKE '%ML%' AND LOWER(name) NOT LIKE '%html%')
           OR LOWER(name) LIKE '%machine learning%'
           OR LOWER(name) LIKE '%машинн%обучен%')
           AND LOWER(key_skills) LIKE '%python%' 
'''
        
        
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\7\ipykernel_23876\3376013832.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

In [ ]:
Результат запроса 

count
0	351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
query_6_5 = f'''select round(avg(length(key_skills)-length(replace(key_skills,'\t','')) + 1), 2) amount_of_skills
          from (
                    select
                    key_skills
                    from vacancies 
                    WHERE (LOWER(name) LIKE '%data scientist%' 
                    OR LOWER(name) LIKE '%data science%'   
                    OR LOWER(name) LIKE '%исследователь данных%'
                    OR (name LIKE '%ML%' AND LOWER(name) NOT LIKE '%html%')
                    OR LOWER(name) LIKE '%machine learning%'
                    OR LOWER(name) LIKE '%машинн%обучен%')) ds
'''
        
        
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\8\ipykernel_14768\3009558792.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   amount_of_skills
0              6.41

In [ ]:
Результат запроса 

amount_of_skills
0	6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
query_6_6 = f'''select experience, round(avg((Coalesce(salary_from, salary_to) + Coalesce(salary_to, salary_from))/2), 0)
                    from vacancies 
                    WHERE (LOWER(name) LIKE '%data scientist%' 
                    OR LOWER(name) LIKE '%data science%'   
                    OR LOWER(name) LIKE '%исследователь данных%'
                    OR (name LIKE '%ML%' AND LOWER(name) NOT LIKE '%html%')
                    OR LOWER(name) LIKE '%machine learning%'
                    OR LOWER(name) LIKE '%машинн%обучен%'
                    AND (salary_to IS NOT NULL OR salary_from IS NOT NULL)
          )
          group by experience
'''
        
        
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\seeg0921\AppData\Local\Temp\8\ipykernel_14768\406298953.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

           experience     round
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  139675.0
3       От 3 до 6 лет  243115.0

In [ ]:
Результат запроса 
	experience	round
0	Более 6 лет	NaN
1	Нет опыта	74643.0
2	От 1 года до 3 лет	139675.0
3	От 3 до 6 лет	243115.0

***

**Выводы по предметному анализу:**

 -Вакансии конкретно для DS-специалистов занимают практически 4% от общего количетва вакансий.

# Общий вывод по проекту

**ТОП 10 вакансий**
Все позиции из этого списка занимают ИТ-профессии.

In [27]:
 # подведем итог исследования, обобщите выводы
query_6_7 = (f'''
    SELECT 
    name vacancy_name, 
    Count(*) vacancy_count
    FROM vacancies
    GROUP BY 1
    ORDER BY 2 DESC
    LIMIT 10
'''
)


df = pd.read_sql_query(query_6_7, connection)
df
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

C:\Users\seeg0921\AppData\Local\Temp\11\ipykernel_40068\1558221379.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_7, connection)

                       vacancy_name  vacancy_count
0           Системный администратор           1761
1                    Программист 1С           1153
2                   Бизнес-аналитик            488
3  Специалист технической поддержки            457
4                Системный аналитик            432
5                          Аналитик            404
6               Инженер-программист            389
7                    Программист 1C            360
8              Frontend-разработчик            242
9     Инженер технической поддержки            230